app/Http/Controllers/Student/AuthController.php

    public function postRegister(Request $request){
        $request->validate([
            'name' => 'required',
            'email' => 'required',
            'password' => 'required',
        ]);

        $student = Student::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `students` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('ZAHID UR REHMAN', 'zk0340983@gmail.com', '$2y$10$BZmUiQ0otHkOToQE15hKkeICKreQw1vAzKspeXpysJISfLpOXg5D6', '2025-08-16 11:34:32', '2025-08-16 11:34:32')

    public function postLogin(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
        ]);

        if (Auth::guard('student')->attempt([
            'email' => $request->email,
            'password' => $request->password,
        ])) {

            $student = Auth::guard('student')->user();
            $profile = $student->profile;
            $permanentAddress = $student->addresses()->where('type', 'permanent')->first();
            $presentAddress = $student->addresses()->where('type', 'present')->first();
            $parentDetail = $student->parentDetail;
            $documents = $student->documents()->get()->keyBy('type');
---
select * from `addresses` where `addresses`.`student_id` = 1 and `addresses`.`student_id` is not null and `type` = 'permanent' limit 1
select * from `addresses` where `addresses`.`student_id` = 1 and `addresses`.`student_id` is not null and `type` = 'present' limit 1
select * from `parent_details` where `parent_details`.`student_id` = 1 and `parent_details`.`student_id` is not null limit 1