app/Http/Controllers/Student/DocumentController.php

    public function store(Request $request)
    {
        $student = Auth::guard('student')->user();

        // Allowed document keys matching your input names
        $documents = [
            'national_id',
            'passport_photo',
            'school_leaving',
            'police_report',
            'parent_consent',
            'olevel',
            'alevel'
        ];

        foreach ($documents as $type) {
            if ($request->hasFile($type)) {
                $file = $request->file($type);

                // Optional: validate file size and type
                $request->validate([
                    $type => 'mimes:pdf,jpg,jpeg,png|max:2048' // 2MB max
                ]);

                // Store file
                $filePath = $file->store("documents/{$student->id}", 'public');

                // Save record in DB
                StudentDocument::updateOrCreate(
                    [
                        'student_id' => $student->id,
                        'type'       => $type
                    ],
                    [
                        'file_path'  => $filePath
                    ]
                );
---
insert into `student_documents` (`student_id`, `type`, `file_path`, `updated_at`, `created_at`) values (2, 'national_id', 'documents/2/bPwuy6gxuvWPIJgtnYrrdnYyHvHH8WjsKhlnm7EN.pdf', '2025-08-16 11:36:13', '2025-08-16 11:36:13')
select * from `student_documents` where (`student_id` = 2 and `type` = 'national_id') limit 1