app/Http/Controllers/Student/StudentProfileController.php

    public function showForm()
    {
        $student = Auth::guard('student')->user();
        $profile = $student->profile;
        $permanentAddress = $student->addresses()->where('type', 'permanent')->first();
        $presentAddress = $student->addresses()->where('type', 'present')->first();
        $parentDetail = $student->parentDetail;
        $documents = $student->documents()->get()->keyBy('type');
---
select * from `addresses` where `addresses`.`student_id` = 2 and `addresses`.`student_id` is not null and `type` = 'permanent' limit 1
select * from `addresses` where `addresses`.`student_id` = 2 and `addresses`.`student_id` is not null and `type` = 'present' limit 1
select * from `parent_details` where `parent_details`.`student_id` = 2 and `parent_details`.`student_id` is not null limit 1

        ]);

        // Save student profile
        $profile = StudentProfile::updateOrCreate(
            ['student_id' => $student->id],
            [
                'first_name' => $validated['first_name'],
                'last_name' => $validated['last_name'],
                'nid' => $validated['nid'],
                'mobile_no' => $validated['mobile_no'],
                'dob' => $validated['dob'],
            ]
        );

        // Save permanent address
        Address::updateOrCreate(
            ['student_id' => $student->id, 'type' => 'permanent'],
            [
                'atoll' => $validated['permanent_atoll'],
                'island' => $validated['permanent_island'],
                'district' => $validated['permanent_district'],
                'address' => $validated['permanent_address'],
            ]
        );

        // Save present address
        Address::updateOrCreate(
            ['student_id' => $student->id, 'type' => 'present'],
            [
                'atoll' => $validated['present_atoll'],
                'island' => $validated['present_island'],
                'district' => $validated['present_district'],
                'address' => $validated['present_address'],
            ]
        );

        // Save parent details
        ParentDetail::updateOrCreate(
            ['student_id' => $student->id],
            [
                'name' => $validated['parent_name'],
                'relation' => $validated['parent_relation'],
                'atoll' => $validated['parent_atoll'],
                'island' => $validated['parent_island'],
                'address' => $validated['parent_address'],
                'mobile_no' => $validated['parent_mobile_no'],
                'email' => $validated['parent_email'],
            ]
        );

        // Mark profile as completed
        $student->profile_completed = true;
        $student->save();
---
insert into `student_profiles` (`student_id`, `first_name`, `last_name`, `nid`, `mobile_no`, `dob`, `updated_at`, `created_at`) values (2, 'ZAHID', 'UR REHMAN', '1210170645717', '03150906075', '2004-11-11', '2025-08-16 11:35:32', '2025-08-16 11:35:32')
select * from `student_profiles` where (`student_id` = 2) limit 1
insert into `addresses` (`student_id`, `type`, `atoll`, `island`, `district`, `address`, `updated_at`, `created_at`) values (2, 'permanent', 'Ea magnam maxime ess', 'Quas delectus et vo', 'Quam qui corrupti q', 'House Number 371 H2 Block Johr Town', '2025-08-16 11:35:32', '2025-08-16 11:35:32')
select * from `addresses` where (`student_id` = 2 and `type` = 'permanent') limit 1
insert into `addresses` (`student_id`, `type`, `atoll`, `island`, `district`, `address`, `updated_at`, `created_at`) values (2, 'present', 'Exercitation elit m', 'Aut est in nostrud', 'Omnis est ad provid', 'Sint velit quas duis', '2025-08-16 11:35:32', '2025-08-16 11:35:32')
select * from `addresses` where (`student_id` = 2 and `type` = 'present') limit 1
insert into `parent_details` (`student_id`, `name`, `relation`, `atoll`, `island`, `address`, `mobile_no`, `email`, `updated_at`, `created_at`) values (2, 'Tanek Ashley', 'Aliquam voluptatem', 'Aliqua Architecto m', 'Autem nisi voluptati', 'Mollit maiores aut e', 'Dicta Nam aliqua Re', 'sicahi@mailinator.com', '2025-08-16 11:35:32', '2025-08-16 11:35:32')
select * from `parent_details` where (`student_id` = 2) limit 1
update `students` set `profile_completed` = 1, `students`.`updated_at` = '2025-08-16 11:35:32' where `id` = 2