app/Http/Controllers/Student/StudentController.php

    public function jobPortal() {
        $students = Student::with(['profile', 'addresses'])->get();
---
select * from `addresses` where `addresses`.`student_id` in (1, 2)
select * from `students`